[
  {
    "file": "experiments/smokeyMountains_Static.js",
    "name": "Smokey Moutains",
    "description": "For this piece, I spent some time adjusting the paramaters of “noiseValue” within the generateHorizon function. Lowering this value would produce harsh and ridged results, while increasing the value would spread the waveforms producing the end result. I also discovered that increasing the parameters of the vertex in function Draw created a kind of diagonal abstract streaming of sunlight that complimented the overall aesthetic of this modern and simplistic interpretation of nature.",
    "background": "I grew up going to the smokey mountains in Tennessee as a kid with my family, and the way the adjusted parameters impacted this piece reminded me a lot of seeing them from a lookout point on a misty morning.  As far as composition goes, I tried to orient the waveforms to favour the golden ratio so that eye naturally is drawn toward the section of larger mountains, while the streams of sunlight were just a fortunate accident. ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/smokeyMountains_Static.js"
  },
  {
    "file": "experiments/smokeyMountains_V2.js",
    "name": "Black Matter (Smokey Mountains Variant)",
    "description": "For this variation, I spent time adjusting the vertex of the piece until they aligned more in the center, and then I adjusted the seed to create more ripples. I also added a lower opacity for a blending effect from the inside out, and ofcourse adjusted the coloring.",
    "background": "The inspiration for this piece is primarily from the first experiment, which was then used to create a variant.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/smokeyMountains_V2.js"
  },
  {
    "file": "experiments/electricBloom_Variance.js",
    "name": "Electric Bloom",
    "description": "For this piece, I opted to experiment with shape manipulations. I did this by adjusting the initial variables for the elements of a grid which were “amount” and “size”, and then experimented with incrementation of the variables. I also worked with rotation, and randomising of colors, just to see how they responded in conjunction with the growth, and having them stop at a certain point or size. ",
    "background": "This inspiration for this piece was tied directly to my final project which will be to have unique shapes and colours generated based on the analyzation of wave forms from a song that is uploaded.  ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/electricBloom_Variance.js"
  },
  {
    "file": "experiments/electricBloom_Variance_V2.js",
    "name": "Violet Implosian (Electric Bloom Variant)",
    "description": "For this varient, I wanted to add a bit more movement and make it more visually interesting so I sped up the bloom and also found a cool reversing effect as it continued to reduce. I also adjusted the colors to be more vibrant. I wanted to make the bloom reverse once it hit another size, but I had some trouble with finding the correct if statement so it continues to expand. ",
    "background": "This inspiration for this piece was tied directly to my final project which will be to have unique shapes and colours generated based on the analyzation of wave forms from a song that is uploaded.  ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/electricBloom_Variance.js"
  },
  {
    "file": "experiments/páfuglMosaic_Variance.js",
    "name": "Páfugl Mosaic",
    "description": "For this experiment, I wanted to work with something a little bit more interactive, but that would generate something beautiful and unique every time you used it. Most of this experiment was just that, “experimenting” with different parameters and substituting the initial objects X and Y axis to be “mouseX” and “mouseY” so that it became a sort of drawing program. From there I continued to adjust field sizes in “drawElement”, as well as the “Math.random” numbers to get interesting results.",
    "background": "Because this piece is more interactive and abstract, there is less theory behind it. However, I loved how the shapes and colours started to remind me of some kind of collage of peacock feathers, hence the name: “Peacock Mosaic”. ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/electricBloom_Variance_V2.js"
  },
  {
    "file": "experiments/stickyNotes.js",
    "name": "Sticky Notes",
    "description": "This piece represents my first attempts at manipulating the grid. I spent time manipulating paramaters and adjusting the number of shapes until it looked visually interesting. ",
    "background": "This experiment was in the lab and was mainly a playground for manipulating grid elements. Things started to resemble sticky notes, so I went with that for a pallet. ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/stickyNotes.js"
  }
  ,
  {
    "file": "experiments/stickyNotes_v2.js",
    "name": "Golden Dice (Sticky Notes Variation) ",
    "description": "On this variation I added a slow rotation to the grid that is sort of hypmotizing and adjusted the gap/amount of the grid. I also adjusted the color pallete, added low-opacity stroke and reduced the overall size of the grid. ",
    "background": "The contrast of gold and purple is more pleasing on the eye and leans more towards a set of golden rotating dice than sticky notes. ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/stickyNotes_V2.js"
  }
  ,
  {
    "file": "experiments/Tonejs-starter/sketch.js",
    "name": "Lofi In the Wind",
    "description": "On this experiment, I used the lower frequencey waveforms that came from frequencies between 0 and 200 to create slower moving waveforms and changed the the first x and y positions to be mouseX and mouseY which made it look like one corner of a sheet was being held while the rest is blowing in the wind. ",
    "background": "On the stroke, I also decdied to incorporate the mouseX and mouseY position so that the color changes dependingo on where the mouse is on the screen. The inspiration for this piece came to me as I went along, and is more focused on interactivity.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-abch21li/blob/main/experiments/Tonejs-starter/sketch.js"
  }
]
